Tekla Open API Reference for Tekla Structures 2025
Polyline Constructor (ViewBase, PointList, Polyline.PolylineAttributes)
 Creates a new polyline instance with the point list using the given attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polyline(
	ViewBase view,
	PointList pointList,
	Polyline.PolylineAttributes attributes
)
Public Sub New (
	view As ViewBase,
	pointList As PointList,
	attributes As Polyline.PolylineAttributes
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
pointList
Type: Tekla.Structures.Drawing.PointList
The point list to be used.
attributes
Type: Tekla.Structures.Drawing.Polyline.PolylineAttributes
The polyline attributes to be used.
See Also
Reference
Polyline Class
Polyline Overload
Tekla.Structures.Drawing Namespace